[
    {
        "title": "Portfolio Website",
        "image": "./media/images/projects/portfolio/portfolio.png",
        "abstract": "My portfolio website is used to display my projects. Each project on display has a brief project summary with a link to a detailed breakdown. My portfolio was designed and developed from scratch. The organization and animations of my portfolio show my ability to structure and style an HTML file with CSS. I use JavaScript to manipulate the HTML and make the website interactive.",
        "skill": {"JavaScript": "I used JavaScript mainly to create/modify HTML elements and generate/execute animations. I also used JS to shadow DOM sections of my page.",
                  "HTML5": "HTML was used to structure my website and hold my content.",
                  "CSS3": "CSS was used to style elements in the HTML file and run CSS animations."},
        "text": "../scripts/database/breakdowns/portfolio.txt",
        "number": 1,
        "stars": 3,
        "type": "AD"
    },
    {
        "title": "My LC Website",
        "image": "./media/images/projects/leetcode/leetcode.png",
        "abstract": "My LeetCode website is where I publish my LeetCode solutions and attempts. I mainly problem-solve using Java or Python3 to maximize my solve times. Recently, I have been using other languages to practice thinking in JavaScript and C/C++. To further develop my JS, HTML5, and CSS3 skills, I decided to create this website from scratch.",
        "skill": {"JavaScript": "JavaScript was used to help structure the HTML files of this website. I used Node.js to maintain a JSON database. Elements in this database were used to display content on the website with the help of JavaScript.",
                  "HTML5": "I used HTML5 to set up the basic page structure and create skeleton elements that awaited content.",
                  "CSS3": "CSS3 was used to control the color scheme of the website to make the website more vibrant. I also used CSS3 to create some passive background animations for visual purposes."},
        "text": "../scripts/database/breakdowns/leetcode.txt",
        "number": 2,
        "stars": 2.5,
        "type": "AD"
    },
    {
        "title": "Transcript Grader",
        "image": "./media/images/projects/grader/grader.png",
        "abstract": "My transcript grader is written in Java and works closely with the util, swing, and awt libraries. Java is one of my favorite programming languages, and this project is a showcase of what I can do in Java. I made a simple graphical user interface with swing and awt components. This project is an implementation of an academic transcript in Java.",
        "skill": {"Java": "Java was used for object-oriented programming with multiple different classes. I used Java libraries like Scanner and JFrame. The scanner was used to read user input and to read text files. JFrame was used to create a simple GUI to make the program simpler."},
        "text": "../scripts/database/breakdowns/grader.txt",
        "number": 3,
        "stars": 3,
        "type": "AD"
    },
    {
        "title": "Rating Predictor",
        "image": "./media/images/projects/predictor/predictor.png",
        "abstract": "Currently being developed or breakdown is not finished.",
        "skill": {},
        "text": "../scripts/database/breakdowns/zeta.txt",
        "number": 4,
        "stars": 3.5,
        "type": "IP"
    },
    {
        "title": "Chess Bot Website",
        "image": "./media/images/projects/chess/chess.png",
        "abstract": "Currently being developed or breakdown is not finished.",
        "skill": {},
        "text": "../scripts/database/breakdowns/zeta.txt",
        "number": 5,
        "stars": 4,
        "type": "IP"
    }
]